ТОИР_демо/src/InformationRegisters/торо_НормативныеРемонтыОборудования/торо_НормативныеРемонтыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_НормативныеРемонтыОборудования</name>
  <resources>
    <name>НормативныйРемонт</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </resources>
  <resources>
    <name>СпособПланирования</name>
    <type>
      <types>CatalogRef.торо_СпособыПланированияРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРемонтныхРабот</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>НеИспользоватьВПланированииДатуВводаВЭксплуатацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособУчетаДатыОтсчета</name>
    <type>
      <types>EnumRef.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>НеУчаствуетВПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьСокращатьМежремонтныйПериодПриПланировании</name>
    <comment>Разрешить сокращать межремонтный период в случае, если начало ремонта приходится на выходной день</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриПланированииГрафикРаботыОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриПланированииГрафикРемонтныхРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПродолжительность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьКоэффициентыРемонтныхОсобенностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьПростоиОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТиповойОР</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/InformationRegisters/торо_НормативныеРемонтыОборудованияУдаленные/торо_НормативныеРемонтыОборудованияУдаленные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_НормативныеРемонтыОборудованияУдаленные</name>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТиповойОР</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/InformationRegisters/торо_ПредшествующиеНормативныеРемонтыОборудования/торо_ПредшествующиеНормативныеРемонтыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ПредшествующиеНормативныеРемонтыОборудования</name>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредшествующийВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТиповойОР</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/InformationRegisters/торо_ПараметрыЗамещенияПланированияРемонтныхРабот/торо_ПараметрыЗамещенияПланированияРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ПараметрыЗамещенияПланированияРемонтныхРабот</name>
  <resources>
    <name>СпособЗамещения</name>
    <type>
      <types>EnumRef.торо_СпособыЗамещенияРемонтов</types>
    </type>
  </resources>
  <resources>
    <name>НачальнаяГраница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КонечнаяГраница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗамещаемыйВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТиповойОР</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/InformationRegisters/торо_ИзмеряемыеПоказателиОбъектовРемонта/торо_ИзмеряемыеПоказателиОбъектовРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ИзмеряемыеПоказателиОбъектовРемонта</name>
  <resources>
    <name>ДопустимыйМинимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </resources>
  <resources>
    <name>ДопустимыйМаксимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </resources>
  <resources>
    <name>КритическийМинимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </resources>
  <resources>
    <name>КритическийМаксимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </resources>
  <attributes>
    <name>ЗначенияКонтролируемыхПоказателейИзОР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаЗамера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удален</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/Enums/торо_СтатусыНормативныхРемонтовИТехКарт/торо_СтатусыНормативныхРемонтовИТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_СтатусыНормативныхРемонтовИТехКарт</name>
  <enumValues>
    <name>ВРазработке</name>
  </enumValues>
  <enumValues>
    <name>Действует</name>
  </enumValues>
  <enumValues>
    <name>Редактируется</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
</mdclass:Enum>

ТОИР_демо/src/Catalogs/торо_ТиповыеОР/торо_ТиповыеОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ТиповыеОР</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Изготовитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.торо_НаправленияОбъектовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойствОР</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НормативныеРемонты</name>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>НормативныйРемонт</name>
      <type>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособПланирования</name>
      <type>
        <types>CatalogRef.торо_СпособыПланированияРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.торо_СтатусыНормативныхРемонтовИТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРемонтныхРабот</name>
      <type>
        <types>CatalogRef.Календари</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособВыполнения</name>
      <type>
        <types>EnumRef.СпособыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>НеИспользоватьВПланированииДатуВводаВЭксплуатацию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособУчетаДатыОтсчета</name>
      <type>
        <types>EnumRef.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>НеУчаствуетВПланировании</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РазрешитьСокращатьМежремонтныйПериодПриПланировании</name>
      <comment>Разрешить сокращать межремонтный период в случае, если начало ремонта приходится на выходной день</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеУчитыватьПриПланированииГрафикРаботыОборудования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеУчитыватьПриПланированииГрафикРемонтныхРабот</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеУчитыватьПродолжительность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьКоэффициентыРемонтныхОсобенностей</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УчитыватьПростоиОборудования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПредшествующиеРемонты</name>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредшествующийВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗамещаемыеРемонты</name>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗамещаемыйВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособЗамещения</name>
      <type>
        <types>EnumRef.торо_СпособыЗамещенияРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>НачальнаяГраница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонечнаяГраница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Запчасти</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>EnumRef.ГрадацииКачества</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НормативныеЗатратыПриТОиР</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ТОИР_демо/src/CommonModules/торо_РаботаСНормативамиСервер/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// торо_РаботаСНормативамиСервер: методы, для работы с нормативами
//
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс
// Процедура записывает все нормативы ОР при программном изменении типового ОР.
// При интерактивном изменении, процедуры записи вызываются из формы ОР поотдельности.
// Процедура должна вызываться ДО изменения реквизита ТиповойОР.
//
// Параметры:
//		ТиповойОРСсылка - СправочникСсылка.торо_ТиповыеОР - ссылка на типовой ОР.
//		ОРСсылка - СправочникСсылка.торо_ОбъектыРемонта - ссылка на объект ремонта.
//		ЗаписыватьНормативныеРемонты - Булево - Записывать нормативные ремонты.
//		ЗаписыватьНормативныеЦепочки - Булево - Записывать нормативные цепочки.
//		ЗаписыватьПредшествующиеРемонты - Булево - Записывать предшествующие ремонты.
//		ЗаписыватьЗамещаемыеРемонты - Булево - Записывать замещаемые ремонты.
//		ЗаписыватьКонтролируемыеПоказатели - Булево - Записывать контролируемые показатели.
//		ЗаписыватьНормыЗапчастей - Булево - Записывать нормы запчастей.
//		
Процедура ЗаписатьНормативыОРПриИзмененииТиповогоОР(ТиповойОРСсылка, ОРСсылка,
	ЗаписыватьНормативныеРемонты 		= Истина,
	ЗаписыватьНормативныеЦепочки 		= Истина,
	ЗаписыватьПредшествующиеРемонты 	= Истина,
	ЗаписыватьЗамещаемыеРемонты 		= Истина,
	ЗаписыватьКонтролируемыеПоказатели  = Истина,
	ЗаписыватьНормыЗапчастей 			= Истина) Экспорт
	
	Если ЗаписыватьНормативныеРемонты Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	&ОРссылка КАК ОбъектРемонта,
		               |	торо_НормативныеРемонтыОборудования.ВидРемонта,
		               |	торо_НормативныеРемонтыОборудования.Ссылка КАК ТиповойОР,
		               |	торо_НормативныеРемонтыОборудования.НормативныйРемонт,
		               |	торо_НормативныеРемонтыОборудования.СпособПланирования,
		               |	торо_НормативныеРемонтыОборудования.ГрафикРемонтныхРабот,
		               |	торо_НормативныеРемонтыОборудования.СпособВыполнения,
		               |	торо_НормативныеРемонтыОборудования.НеИспользоватьВПланированииДатуВводаВЭксплуатацию,
		               |	торо_НормативныеРемонтыОборудования.СпособУчетаДатыОтсчета,
		               |	торо_НормативныеРемонтыОборудования.НеУчаствуетВПланировании,
		               |	торо_НормативныеРемонтыОборудования.РазрешитьСокращатьМежремонтныйПериодПриПланировании,
		               |	торо_НормативныеРемонтыОборудования.НеУчитыватьПриПланированииГрафикРаботыОборудования,
		               |	торо_НормативныеРемонтыОборудования.НеУчитыватьПриПланированииГрафикРемонтныхРабот,
		               |	торо_НормативныеРемонтыОборудования.НеУчитыватьПродолжительность,
		               |	торо_НормативныеРемонтыОборудования.ИспользоватьКоэффициентыРемонтныхОсобенностей,
		               |	торо_НормативныеРемонтыОборудования.УчитыватьПростоиОборудования,
		               |	0 КАК Приоритет
		               |ПОМЕСТИТЬ ТабБазПриоритетов
		               |ИЗ
		               |	Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_НормативныеРемонтыОборудования
		               |ГДЕ
		               |	торо_НормативныеРемонтыОборудования.Ссылка = &НовТиповойОР
		               |	И торо_НормативныеРемонтыОборудования.Статус = ЗНАЧЕНИЕ(Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует)
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	торо_НормативныеРемонтыОборудования.ОбъектРемонта,
		               |	торо_НормативныеРемонтыОборудования.ВидРемонта,
		               |	торо_НормативныеРемонтыОборудования.ТиповойОР,
		               |	торо_НормативныеРемонтыОборудования.НормативныйРемонт,
		               |	торо_НормативныеРемонтыОборудования.СпособПланирования,
		               |	торо_НормативныеРемонтыОборудования.ГрафикРемонтныхРабот,
		               |	торо_НормативныеРемонтыОборудования.СпособВыполнения,
		               |	торо_НормативныеРемонтыОборудования.НеИспользоватьВПланированииДатуВводаВЭксплуатацию,
		               |	торо_НормативныеРемонтыОборудования.СпособУчетаДатыОтсчета,
		               |	торо_НормативныеРемонтыОборудования.НеУчаствуетВПланировании,
		               |	торо_НормативныеРемонтыОборудования.РазрешитьСокращатьМежремонтныйПериодПриПланировании,
		               |	торо_НормативныеРемонтыОборудования.НеУчитыватьПриПланированииГрафикРаботыОборудования,
		               |	торо_НормативныеРемонтыОборудования.НеУчитыватьПриПланированииГрафикРемонтныхРабот,
		               |	торо_НормативныеРемонтыОборудования.НеУчитыватьПродолжительность,
		               |	торо_НормативныеРемонтыОборудования.ИспользоватьКоэффициентыРемонтныхОсобенностей,
		               |	торо_НормативныеРемонтыОборудования.УчитыватьПростоиОборудования,
		               |	1
		               |ИЗ
		               |	РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
		               |ГДЕ
		               |	торо_НормативныеРемонтыОборудования.ОбъектРемонта = &ОРСсылка
		               |	И торо_НормативныеРемонтыОборудования.ТиповойОР = ЗНАЧЕНИЕ(Справочник.торо_ТиповыеОР.ПустаяСсылка)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТабБазПриоритетов.ОбъектРемонта,
		               |	ТабБазПриоритетов.ВидРемонта,
		               |	МАКСИМУМ(ТабБазПриоритетов.Приоритет) КАК Приоритет
		               |ПОМЕСТИТЬ ТабПриоритетов
		               |ИЗ
		               |	ТабБазПриоритетов КАК ТабБазПриоритетов
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТабБазПриоритетов.ОбъектРемонта,
		               |	ТабБазПриоритетов.ВидРемонта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТабБазПриоритетов.ОбъектРемонта,
		               |	ТабБазПриоритетов.ВидРемонта,
		               |	ТабБазПриоритетов.ТиповойОР,
		               |	ТабБазПриоритетов.НормативныйРемонт,
		               |	ТабБазПриоритетов.СпособПланирования,
		               |	ТабБазПриоритетов.ГрафикРемонтныхРабот,
		               |	ТабБазПриоритетов.СпособВыполнения,
		               |	ТабБазПриоритетов.НеИспользоватьВПланированииДатуВводаВЭксплуатацию,
		               |	ТабБазПриоритетов.СпособУчетаДатыОтсчета,
		               |	ТабБазПриоритетов.НеУчаствуетВПланировании,
		               |	ТабБазПриоритетов.РазрешитьСокращатьМежремонтныйПериодПриПланировании,
		               |	ТабБазПриоритетов.НеУчитыватьПриПланированииГрафикРаботыОборудования,
		               |	ТабБазПриоритетов.НеУчитыватьПриПланированииГрафикРемонтныхРабот,
		               |	ТабБазПриоритетов.НеУчитыватьПродолжительность,
		               |	ТабБазПриоритетов.ИспользоватьКоэффициентыРемонтныхОсобенностей,
		               |	ТабБазПриоритетов.УчитыватьПростоиОборудования,
		               |	ВЫБОР
		               |		КОГДА ТабПриоритетов.Приоритет ЕСТЬ NULL 
		               |			ТОГДА ЛОЖЬ
		               |		ИНАЧЕ ИСТИНА
		               |	КОНЕЦ КАК Приоритет
		               |ИЗ
		               |	ТабБазПриоритетов КАК ТабБазПриоритетов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТабПриоритетов КАК ТабПриоритетов
		               |		ПО ТабБазПриоритетов.ОбъектРемонта = ТабПриоритетов.ОбъектРемонта
		               |			И ТабБазПриоритетов.ВидРемонта = ТабПриоритетов.ВидРемонта
		               |			И ТабБазПриоритетов.Приоритет = ТабПриоритетов.Приоритет";
					   
		Запрос.УстановитьПараметр("НовТиповойОР", ТиповойОРСсылка);
		Запрос.УстановитьПараметр("ОРСсылка",ОРСсылка);
		Запрос.УстановитьПараметр("ТекТиповойОР",ОРСсылка.ТиповойОР);
		
		ТаблицаНормативов = Запрос.Выполнить().Выгрузить();
		
		НаборЗаписей = РегистрыСведений.торо_НормативныеРемонтыОборудования.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОбъектРемонта.Установить(ОРСсылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Загрузить(ТаблицаНормативов);
		НаборЗаписей.Записать();
		
		НаборЗаписей = РегистрыСведений.торо_НормативныеРемонтыОборудованияУдаленные.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОбъектРемонта.Установить(ОРСсылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
	Если ЗаписыватьНормативныеЦепочки Тогда
		
		// Записываются при записи Типового ОР. Записывать дополнительно нет необходимости.
				
	КонецЕсли;
	
	Если ЗаписыватьПредшествующиеРемонты Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_НормативныеРемонтыОборудования.ВидРемонта,
		               |	торо_НормативныеРемонтыОборудования.Ссылка
		               |ПОМЕСТИТЬ ДействующиеВР
		               |ИЗ
		               |	Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_НормативныеРемонтыОборудования
		               |ГДЕ
		               |	торо_НормативныеРемонтыОборудования.Ссылка = &НовТиповойОР
		               |	И торо_НормативныеРемонтыОборудования.Статус = ЗНАЧЕНИЕ(Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	торо_ТиповыеОРПредшествующиеРемонты.ВидРемонта,
		               |	&ОРСсылка КАК ОбъектРемонта,
		               |	торо_ТиповыеОРПредшествующиеРемонты.ПредшествующийВидРемонта,
		               |	торо_ТиповыеОРПредшествующиеРемонты.Ссылка КАК ТиповойОР,
		               |	0 КАК Приоритет
		               |ПОМЕСТИТЬ ТабБазПриоритетов
		               |ИЗ
		               |	ДействующиеВР КАК торо_ТиповыеОРНормативныеРемонты
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР.ПредшествующиеРемонты КАК торо_ТиповыеОРПредшествующиеРемонты
		               |		ПО торо_ТиповыеОРНормативныеРемонты.Ссылка = торо_ТиповыеОРПредшествующиеРемонты.Ссылка
		               |			И торо_ТиповыеОРНормативныеРемонты.ВидРемонта = торо_ТиповыеОРПредшествующиеРемонты.ВидРемонта
		               |			И (торо_ТиповыеОРПредшествующиеРемонты.ПредшествующийВидРемонта В
		               |				(ВЫБРАТЬ
		               |					ДействующиеВР.ВидРемонта
		               |				ИЗ
		               |					ДействующиеВР КАК ДействующиеВР))
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	торо_ПредшествующиеНормативныеРемонтыОборудования.ВидРемонта,
		               |	торо_ПредшествующиеНормативныеРемонтыОборудования.ОбъектРемонта,
		               |	торо_ПредшествующиеНормативныеРемонтыОборудования.ПредшествующийВидРемонта,
		               |	торо_ПредшествующиеНормативныеРемонтыОборудования.ТиповойОР,
		               |	1
		               |ИЗ
		               |	РегистрСведений.торо_ПредшествующиеНормативныеРемонтыОборудования КАК торо_ПредшествующиеНормативныеРемонтыОборудования
		               |ГДЕ
		               |	торо_ПредшествующиеНормативныеРемонтыОборудования.ОбъектРемонта = &ОРСсылка
		               |	И торо_ПредшествующиеНормативныеРемонтыОборудования.ТиповойОР = ЗНАЧЕНИЕ(Справочник.торо_ТиповыеОР.ПустаяСсылка)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТабБазПриоритетов.ВидРемонта,
		               |	ТабБазПриоритетов.ОбъектРемонта,
		               |	МАКСИМУМ(ТабБазПриоритетов.Приоритет) КАК Приоритет
		               |ПОМЕСТИТЬ ТабПриоритетов
		               |ИЗ
		               |	ТабБазПриоритетов КАК ТабБазПриоритетов
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТабБазПриоритетов.ВидРемонта,
		               |	ТабБазПриоритетов.ОбъектРемонта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТабБазПриоритетов.ВидРемонта,
		               |	ТабБазПриоритетов.ОбъектРемонта,
		               |	ТабБазПриоритетов.ПредшествующийВидРемонта,
		               |	ТабБазПриоритетов.ТиповойОР,
		               |	ВЫБОР
		               |		КОГДА ТабПриоритетов.Приоритет ЕСТЬ NULL 
		               |			ТОГДА ЛОЖЬ
		               |		ИНАЧЕ ИСТИНА
		               |	КОНЕЦ КАК Приоритет
		               |ИЗ
		               |	ТабБазПриоритетов КАК ТабБазПриоритетов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТабПриоритетов КАК ТабПриоритетов
		               |		ПО ТабБазПриоритетов.ОбъектРемонта = ТабПриоритетов.ОбъектРемонта
		               |			И ТабБазПриоритетов.ВидРемонта = ТабПриоритетов.ВидРемонта
		               |			И ТабБазПриоритетов.Приоритет = ТабПриоритетов.Приоритет";
		
		Запрос.УстановитьПараметр("НовТиповойОР", ТиповойОРСсылка);
		Запрос.УстановитьПараметр("ОРСсылка",ОРСсылка);
		Запрос.УстановитьПараметр("ТекТиповойОР",ОРСсылка.ТиповойОР);
		
		ТаблицаПредшествующих = Запрос.Выполнить().Выгрузить();
		
		НаборЗаписей = РегистрыСведений.торо_ПредшествующиеНормативныеРемонтыОборудования.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОбъектРемонта.Установить(ОРСсылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Загрузить(ТаблицаПредшествующих);
		НаборЗаписей.Записать();
		
	КонецЕсли;
		
	Если ЗаписыватьЗамещаемыеРемонты Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_НормативныеРемонтыОборудования.ВидРемонта,
		               |	торо_НормативныеРемонтыОборудования.Ссылка
		               |ПОМЕСТИТЬ ДействующиеВР
		               |ИЗ
		               |	Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_НормативныеРемонтыОборудования
		               |ГДЕ
		               |	торо_НормативныеРемонтыОборудования.Ссылка = &НовТиповойОР
		               |	И торо_НормативныеРемонтыОборудования.Статус = ЗНАЧЕНИЕ(Перечисление.торо_СтатусыНормативныхРемонтовИТехКарт.Действует)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	торо_ТиповыеОРЗамещаемыеРемонты.ВидРемонта,
		               |	&ОРСсылка КАК ОбъектРемонта,
		               |	торо_ТиповыеОРЗамещаемыеРемонты.ЗамещаемыйВидРемонта,
		               |	торо_ТиповыеОРЗамещаемыеРемонты.Ссылка КАК ТиповойОР,
		               |	торо_ТиповыеОРЗамещаемыеРемонты.СпособЗамещения,
		               |	торо_ТиповыеОРЗамещаемыеРемонты.НачальнаяГраница,
		               |	торо_ТиповыеОРЗамещаемыеРемонты.КонечнаяГраница,
		               |	0 КАК Приоритет
		               |ПОМЕСТИТЬ ТабБазПриоритетов
		               |ИЗ
		               |	Справочник.торо_ТиповыеОР.НормативныеРемонты КАК торо_ТиповыеОРНормативныеРемонты
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР.ЗамещаемыеРемонты КАК торо_ТиповыеОРЗамещаемыеРемонты
		               |		ПО торо_ТиповыеОРНормативныеРемонты.Ссылка = торо_ТиповыеОРЗамещаемыеРемонты.Ссылка
		               |			И торо_ТиповыеОРНормативныеРемонты.ВидРемонта = торо_ТиповыеОРЗамещаемыеРемонты.ВидРемонта
		               |			И (торо_ТиповыеОРЗамещаемыеРемонты.ЗамещаемыйВидРемонта В
		               |				(ВЫБРАТЬ
		               |					ДействующиеВР.ВидРемонта
		               |				ИЗ
		               |					ДействующиеВР КАК ДействующиеВР))
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ВидРемонта,
		               |	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ОбъектРемонта,
		               |	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ЗамещаемыйВидРемонта,
		               |	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ТиповойОР,
		               |	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.СпособЗамещения,
		               |	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.НачальнаяГраница,
		               |	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.КонечнаяГраница,
		               |	1
		               |ИЗ
		               |	РегистрСведений.торо_ПараметрыЗамещенияПланированияРемонтныхРабот КАК торо_ПараметрыЗамещенияПланированияРемонтныхРабот
		               |ГДЕ
		               |	торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ОбъектРемонта = &ОРСсылка
		               |	И торо_ПараметрыЗамещенияПланированияРемонтныхРабот.ТиповойОР = ЗНАЧЕНИЕ(Справочник.торо_ТиповыеОР.ПустаяСсылка)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТабБазПриоритетов.ВидРемонта,
		               |	ТабБазПриоритетов.ОбъектРемонта,
		               |	МАКСИМУМ(ТабБазПриоритетов.Приоритет) КАК Приоритет
		               |ПОМЕСТИТЬ ТабПриоритетов
		               |ИЗ
		               |	ТабБазПриоритетов КАК ТабБазПриоритетов
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТабБазПриоритетов.ВидРемонта,
		               |	ТабБазПриоритетов.ОбъектРемонта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТабБазПриоритетов.ВидРемонта,
		               |	ТабБазПриоритетов.ОбъектРемонта,
		               |	ТабБазПриоритетов.ЗамещаемыйВидРемонта,
		               |	ТабБазПриоритетов.ТиповойОР,
		               |	ТабБазПриоритетов.СпособЗамещения,
		               |	ТабБазПриоритетов.НачальнаяГраница,
		               |	ТабБазПриоритетов.КонечнаяГраница,
		               |	ВЫБОР
		               |		КОГДА ТабПриоритетов.Приоритет ЕСТЬ NULL 
		               |			ТОГДА ЛОЖЬ
		               |		ИНАЧЕ ИСТИНА
		               |	КОНЕЦ КАК Приоритет
		               |ИЗ
		               |	ТабБазПриоритетов КАК ТабБазПриоритетов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТабПриоритетов КАК ТабПриоритетов
		               |		ПО ТабБазПриоритетов.ОбъектРемонта = ТабПриоритетов.ОбъектРемонта
		               |			И ТабБазПриоритетов.ВидРемонта = ТабПриоритетов.ВидРемонта
		               |			И ТабБазПриоритетов.Приоритет = ТабПриоритетов.Приоритет";
		
		Запрос.УстановитьПараметр("НовТиповойОР", ТиповойОРСсылка);
		Запрос.УстановитьПараметр("ОРСсылка",ОРСсылка);
		Запрос.УстановитьПараметр("ТекТиповойОР",ОРСсылка.ТиповойОР);
		
		ТаблицаЗамещаемых = Запрос.Выполнить().Выгрузить();
		
		НаборЗаписей = РегистрыСведений.торо_ПараметрыЗамещенияПланированияРемонтныхРабот.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОбъектРемонта.Установить(ОРСсылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Загрузить(ТаблицаЗамещаемых);
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
	Если ЗаписыватьНормыЗапчастей Тогда
		
		
	КонецЕсли;
	
	Если ЗаписыватьКонтролируемыеПоказатели Тогда
		
		// Удалим неиспользуемые показатели, оставшиеся от прошлого типового.
		Если НЕ ЗначениеЗаполнено(ТиповойОРСсылка) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	торо_ИзмеряемыеПоказателиОбъектовРемонта.Показатель
			               |ИЗ
			               |	РегистрСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта КАК торо_ИзмеряемыеПоказателиОбъектовРемонта
			               |ГДЕ
			               |	торо_ИзмеряемыеПоказателиОбъектовРемонта.ОбъектРемонта = &ОРСсылка
			               |	И торо_ИзмеряемыеПоказателиОбъектовРемонта.Удален";
			Запрос.УстановитьПараметр("ОРСсылка",ОРСсылка);
			Результат = Запрос.Выполнить();
			Если НЕ Результат.Пустой() Тогда
				Выборка = Результат.Выбрать();
				Пока Выборка.Следующий() Цикл
					МенеджерЗаписи = РегистрыСведений.торо_ИзмеряемыеПоказателиОбъектовРемонта.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.ОбъектРемонта = ОРСсылка;
					МенеджерЗаписи.Показатель = Выборка.Показатель;
					МенеджерЗаписи.Прочитать();
					МенеджерЗаписи.Удалить();
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
